** Initial mesh
#+begin_src R :results output :tangle scripts/figure_2.R :exports both :session *R-local*
options(crayon.enabled=FALSE)
library(tidyverse) 
library(patchwork)
library(viridis)

# Load data 
read_csv("../data/tx.csv", progress=FALSE, show_col_types = FALSE) %>%
  as_tibble() %>% 
  mutate(tx=row_number())  -> tx

read_csv("../data/rx.csv", progress=FALSE, show_col_types = FALSE) %>%
  as_tibble() %>% 
  mutate(rx=row_number()) -> rx

read_csv("../data/initial_mesh.csv", progress=FALSE, show_col_types = FALSE) %>%
  as_tibble() -> initial_mesh

rx %>% select(id=rx, pos.x=Inline, pos.y=Z) -> recv
tx %>% select(id=tx, pos.x=Inline, pos.y=Z) -> trans

shapes <- c(20, 17)
names(shapes) <- c("Tx", "Rx")

initial_mesh %>% 
    mutate(rho=log(rho)) %>%
    ggplot() +
    geom_polygon(aes(group = triangles, x = Y, y = -Z), size=.01, fill="white", color="black") +
    # Plot Tx, Rx
    geom_point(data=trans, aes(x=pos.x, y=-pos.y, shape="Tx"), color="blue") + 
    geom_point(data=recv, aes(x=pos.x, y=-pos.y, shape="Rx"), color="red") +  
    scale_shape_manual(values=shapes) +
    labs(
      title="A) Inline 04Tx013a area", 
      y="Height (m)", x="Length (m)"
      ) +
    coord_cartesian(ylim=c(-6e3, 1000), xlim=c(-10e3, 52e3)) + 
    theme_bw(base_size=20) +
    theme(
      panel.grid.major = element_blank(), 
      panel.grid.minor = element_blank(),
      legend.position="none"
    ) -> a

a + 
geom_rect(data=tibble(), aes(xmin=-1e3, xmax=42e3, ymin=-200, ymax=-2e3), alpha=.3, color="black", fill="gray") +
geom_text(data=tibble(), aes(x=39e3, y=500, label="Rx/Tx area"), size=5) -> p.a

initial_mesh %>% 
    ggplot() +
    geom_polygon(aes(group = triangles, x = Y, y = -Z), size=.01, fill="white", color="grey50") +
    # Plot Tx, Rx
    geom_point(data=trans, aes(x=pos.x, y=-pos.y, shape="Tx"), color="blue", size=3) + 
    geom_point(data=recv, aes(x=pos.x, y=-pos.y, shape="Rx"), color="red", size=8) + 
    geom_text(data=recv, aes(x=pos.x, y=-pos.y, label=id), size=4.5) + 
    geom_text(data=trans %>% filter(id %in% c(seq(0,206, 10))), aes(x=pos.x, y=-pos.y+60, label=id), size=5) + 
    guides(shape = guide_legend(override.aes = list(colour = "black"))) + 
    scale_shape_manual(values=shapes) +
    labs(title="B) Zoom into the Rx/Tx area", y="Height (m)", x="Length (m)") +
#    xlim(0 - 12e3, 42e3 + 11e3) + ylim(-6e3, 0) + 
    coord_cartesian(
      ylim=c(-1.6e3, -400),
      xlim=c(1.5e3, 39.5e3)
    ) +
    theme_bw(base_size=20) +
    theme(
      panel.grid.major = element_blank(), 
      panel.grid.minor = element_blank(),
      legend.position="none"
    ) -> p.b

p.a + p.b + plot_layout(heights = c(1, 4), ncol=1) -> p 

ggsave(
  dpi = 100,
  filename="figure_2.png",
  plot = p,
  #path = "~/Documents/2022/CMP223/artigo_final/evaluation/images",
  path = "../images",
  width = 15,
  height = 10
)


    #+end_src

    #+RESULTS:
    : Error: '../data/tx.csv' does not exist in current working directory ('/Users/brunoalves/Documents/2022/CARLA-companion').
    : Error: '../data/rx.csv' does not exist in current working directory ('/Users/brunoalves/Documents/2022/CARLA-companion').
    : Error: '../data/initial_mesh.csv' does not exist in current working directory ('/Users/brunoalves/Documents/2022/CARLA-companion').
    : Error in grDevices::pdf(file = filename, ..., version = version) : 
    :   cannot open file '../images/figure_2.png'
**** Iterations
#+begin_src R :results output :tangle scripts/figure_4.R :exports both :session *R-local*
options(crayon.enabled=FALSE)
library(tidyverse) 
library(patchwork)

read_csv("../data/traces_raw.csv.gz", progress=FALSE) -> traces.raw
read_csv("../data/traces_enriched.csv.gz", progress=FALSE) -> traces.enriched

# MANAGER OPERATIONS:
#1 mpi_manager_send_subset    
#2 mpi_manager_receive_results
#3 jacobianCompute            
#4 smoothingOccam             
#5 Occam                      
#6 iteration

traces.raw %>% 
  filter(trace.exec==1, Rank==0) %>%
  select(Operation, Start, End, Imbrication) %>% 
#  filter(Operation %in% c("iteration", "jacobianCompute", "smoothingOccam")) %>% 
  filter(Operation %in% c("iteration")) %>% 
  group_by(Operation) %>% 
  mutate(Repeat=row_number()) -> iterations

X.min <- 1700
X.max <- 2450
base.size <- 20
iterations %>% 
  ggplot()+
  geom_rect(
    aes(
      xmin=Start, xmax=End,
      ymin=0, ymax=1, 
#      fill=
    ), color="black", fill="gray"
  ) + 
  geom_text(aes(x=Start + (End-Start)/2, y=0.5, label=Repeat), size=5) + 
#  geom_point()+
#  labs(x="x",y="y")+
#  ylim(0, 1) + 
  coord_cartesian(xlim=c(X.min, X.max), ylim=c(0.04, 0.96)) +
  facet_wrap(~"Iteration") + 
  theme_bw(base_size=base.size) +
  theme(
    axis.text.x = element_blank(),
    axis.ticks.x = element_blank(), 
    axis.title.x = element_blank(),

    axis.text.y = element_blank(),
    axis.ticks.y = element_blank(), 
    axis.title.y = element_blank(),

    plot.margin = margin(0, 0, 0.1, 0, "cm")
  ) -> plot.it

plot.it
#+end_src

#+RESULTS:
: Error: '../data/traces_raw.csv.gz' does not exist in current working directory ('/Users/brunoalves/Documents/2022/CARLA-companion').
: Error: '../data/traces_enriched.csv.gz' does not exist in current working directory ('/Users/brunoalves/Documents/2022/CARLA-companion').

** Microkernel's impact on MARE2DEM performance - TABLE
#+begin_src R :tangle scripts/table_1.R :results table :exports both :session *R-local*
options(crayon.enabled=FALSE)
library(tidyverse) 
library(patchwork)

read_csv("../data/mean_trace.csv.gz", progress=FALSE) -> mean_trace

mean_trace %>% 
  pull(Duration.mean) %>% 
  sum() -> total.time

mean_trace %>% 
  group_by(Operation) %>%  
  summarize(
    instances = n(),
    Op.time = sum(Duration.mean), 
    Op.time.min = min(Duration.mean), 
    Op.time.mean = mean(Duration.mean),
    Op.time.max = max(Duration.mean)
) %>%
  mutate(relative_time=100*(Op.time/total.time)) %>%
  arrange(relative_time) -> table

table %>% 
  ungroup() %>%
  summarize(
    instances=sum(instances),
    relative_time=sum(relative_time)
  ) %>% 
  mutate(
    Operation = "Total", 
    Op.time = 0,
    Op.time.min = 0,
    Op.time.mean = 0,
    Op.time.max = 0
  ) -> table.total

bind_rows(table, table.total) %>%
  arrange(relative_time) %>% 
  mutate(relative_time = sprintf("%.2f%%", relative_time)) %>%
  mutate(instances=sprintf("%.1fK", instances/1000)) %>%
  mutate(Op.time.min=sprintf("%.2fs", Op.time.min)) %>%
  mutate(Op.time.mean=sprintf("%.2fs", Op.time.mean)) %>%
  mutate(Op.time.max=sprintf("%.2fs", Op.time.max)) %>%
  select(Operation, instances, relative_time, Op.time.min, Op.time.mean, Op.time.max) %>% 
  as.data.frame

#+end_src

#+RESULTS:
| local_refinement | 43.3K  |   3.14% | 0.26s | 0.81s | 1.77s  |
| lhs_gen          | 304.1K |   3.86% | 0.03s | 0.14s | 0.66s  |
| derivs_comp_adj  | 45.6K  |  11.11% | 0.03s | 2.72s | 19.01s |
| error_estimate   | 105.3K |  33.72% | 0.19s | 3.57s | 14.42s |
| primal_solve     | 304.1K |  48.16% | 0.20s | 1.77s | 8.41s  |
| Total            | 802.4K | 100.00% | 0.00s | 0.00s | 0.00s  |

*** Build dataframe
#+begin_src R :results output :tangle scripts/figure_8.R :exports both :session *R-local*
options(crayon.enabled=FALSE)
library(tidyverse) 
library(patchwork)

read_csv("../data/traces_raw.csv.gz", progress=FALSE) -> traces.raw
read_csv("../data/mean_trace.csv.gz", progress=FALSE) -> mean_trace

traces.raw %>% 
  filter(Operation == "iteration") %>% 
  mutate(Duration = End - Start) %>%  
  group_by(trace.exec) %>%  
  mutate(Iteration = row_number()) %>%  
  group_by(Iteration) %>%
  summarize(
    Duration.mean=mean(Duration), 
    Duration.se=3*sd(Duration)/sqrt(n())  
  ) %>% 
  print -> iterations.duration

traces.raw %>% 
#  filter(Rank==0) %>% select(Operation) %>% distinct()
  filter(Operation %in% c("jacobianCompute", "smoothingOccam")) %>% 
  mutate(Phase=Operation) %>%
  mutate(Phase=gsub("jacobianCompute", "Jacobian", Phase)) %>% 
  mutate(Phase=gsub("smoothingOccam", "Smoothing", Phase)) %>%
  mutate(Duration = End - Start) %>%  
  group_by(trace.exec, Phase) %>%  
  mutate(Iteration = row_number()) %>%  
  group_by(Iteration, Phase) %>%
  summarize(Duration.mean=mean(Duration),     Duration.se=3*sd(Duration)/sqrt(n())  ) %>%
  print -> iterations.phases.duration
#  select(trace.exec, Duration, Operation)

mean_trace %>% 
  ungroup() %>%
  filter(Operation!="local_refinement") %>% 
  group_by(Iteration, Phase) %>%
  summarize(processed_nodes=sum(NodesFrom)) -> p_nodes
  
mean_trace %>% 
  select(Iteration, Phase, Repetition) %>% 
  distinct() %>% 
  group_by(Iteration, Phase) %>% 
  summarize(Repetition = n()) %>%
  print(n=nrow(.)) -> repetitions
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 8 x 3
  Iteration Duration.mean Duration.se
      <int>         <dbl>       <dbl>
1         1          815.        3.75
2         2          852.        8.02
3         3          806.        4.71
4         4         1099.        9.11
5         5         3742.        6.88
6         6         3569.       13.4 
7         7         3533.        6.57
8         8         4081.        5.72
`summarise()` has grouped output by 'Iteration'. You can override
using the `.groups` argument.
# A tibble: 16 x 4
# Groups:   Iteration [8]
   Iteration Phase     Duration.mean Duration.se
       <int> <chr>             <dbl>       <dbl>
 1         1 Jacobian           508.        1.81
 2         1 Smoothing          307.        2.58
 3         2 Jacobian           585.        6.47
 4         2 Smoothing          267.        1.62
 5         3 Jacobian           567.        3.52
 6         3 Smoothing          238.        1.16
 7         4 Jacobian           492.        3.81
 8         4 Smoothing          607.        5.82
 9         5 Jacobian           640.        2.20
10         5 Smoothing         3102.        5.01
11         6 Jacobian           912.       10.4 
12         6 Smoothing         2656.        8.30
13         7 Jacobian           833.        2.60
14         7 Smoothing         2700.        4.75
15         8 Jacobian           834.        1.77
16         8 Smoothing         3246.        7.02
`summarise()` has grouped output by 'Iteration'. You can override
using the `.groups` argument.
`summarise()` has grouped output by 'Iteration'. You can override
using the `.groups` argument.
# A tibble: 16 x 3
# Groups:   Iteration [8]
   Iteration Phase     Repetition
       <dbl> <chr>          <int>
 1         1 Jacobian           1
 2         1 Smoothing          1
 3         2 Jacobian           1
 4         2 Smoothing          1
 5         3 Jacobian           1
 6         3 Smoothing          1
 7         4 Jacobian           1
 8         4 Smoothing          2
 9         5 Jacobian           1
10         5 Smoothing          6
11         6 Jacobian           1
12         6 Smoothing          6
13         7 Jacobian           1
14         7 Smoothing          6
15         8 Jacobian           1
16         8 Smoothing          7
#+end_example

